src/cfe/АиФ_МСФО/DataProcessors/АиФ_ПомощникКонсолидации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>АиФ_ПомощникКонсолидации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоАктивныеПравила</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cfe/АиФ_МСФО/DataProcessors/АиФ_ПомощникКонсолидации/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(Объект.ПериодПо) Тогда
		Объект.ПериодПо = КонецМесяца(ТекущаяДатаСеанса());
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.ПериодС) Тогда
		Объект.ПериодС = НачалоМесяца(Объект.ПериодПо);
	КонецЕсли;
	Объект.ТолькоАктивныеПравила = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредпросмотр(Команда)

	ЗаполнитьПредпросмотрНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредпросмотрНаСервере()

	Предпросмотр.Очистить();
	Таблица = АиФ_МСФОСервер.ТаблицаКонсолидации(Объект.ПериодС, КонецДня(Объект.ПериодПо));
	Для Каждого Строка Из Таблица Цикл
		НоваяСтрока = Предпросмотр.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьИсключенияВГО(Команда)

	СоздатьИсключенияВГОНаСервере();
	ЗаполнитьПредпросмотрНаСервере();
	ПоказатьПредупреждение(, НСтр("ru = 'Документы исключения ВГО созданы (см. список ниже). Проведите их после проверки.'"));

КонецПроцедуры

&НаСервере
Процедура СоздатьИсключенияВГОНаСервере()

	Созданные = АиФ_МСФОСервер.СоздатьДокументыИсключенияВГО(
		Объект.ПериодС,
		КонецДня(Объект.ПериодПо),
		Объект.ТолькоАктивныеПравила);

	Части = Новый Массив;
	Для Каждого СсылкаДокумента Из Созданные Цикл
		Части.Добавить(Строка(СсылкаДокумента));
	КонецЦикла;
	СозданныеДокументы = СтрСоединить(Части, Символы.ПС);

КонецПроцедуры
